#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_vpc.main: Refreshing state... [id=vpc-0019a2de5322a3397]
aws_ssm_parameter.foo: Refreshing state... [id=foo]
data.aws_availability_zones.all: Reading...
aws_iam_role.role-launch-ec2: Refreshing state... [id=role-launch-ec2]
aws_iam_instance_profile.ec2-instance-profile: Refreshing state... [id=ec2_instance_profile]
data.aws_availability_zones.all: Read complete after 0s [id=us-east-1]
aws_subnet.public-subnet[3]: Refreshing state... [id=subnet-0086c7e08f9686a98]
aws_subnet.public-subnet[4]: Refreshing state... [id=subnet-08e6078c1c8efdfdd]
aws_subnet.private-subnet[3]: Refreshing state... [id=subnet-0913fab23c6fc946e]
aws_subnet.private-subnet[1]: Refreshing state... [id=subnet-04dbb45a2d8b3f2b0]
aws_internet_gateway.igw: Refreshing state... [id=igw-0ac123e9b2f9f6dc9]
aws_security_group.sg: Refreshing state... [id=sg-0ecf005d25660f34a]
aws_subnet.public-subnet[2]: Refreshing state... [id=subnet-02d15ccd3b52e5319]
aws_subnet.private-subnet[2]: Refreshing state... [id=subnet-04907e983cda8b829]
aws_subnet.private-subnet[4]: Refreshing state... [id=subnet-04515c5c0cc6a3b7c]
aws_subnet.private-subnet[5]: Refreshing state... [id=subnet-0a30a8a1ceddedc4d]
aws_subnet.private-subnet[0]: Refreshing state... [id=subnet-098d6efe9b7c412e0]
aws_subnet.public-subnet[5]: Refreshing state... [id=subnet-0b6f663793f911886]
aws_subnet.public-subnet[0]: Refreshing state... [id=subnet-0a038ffe273e528cf]
aws_subnet.public-subnet[1]: Refreshing state... [id=subnet-084b421443cfcb750]
aws_route.public_subnets_igw[4]: Refreshing state... [id=r-rtb-03433f2e9d1e10e7c1080289494]
aws_route.public_subnets_igw[0]: Refreshing state... [id=r-rtb-03433f2e9d1e10e7c1080289494]
aws_route.public_subnets_igw[5]: Refreshing state... [id=r-rtb-03433f2e9d1e10e7c1080289494]
aws_route.public_subnets_igw[2]: Refreshing state... [id=r-rtb-03433f2e9d1e10e7c1080289494]
aws_route.public_subnets_igw[1]: Refreshing state... [id=r-rtb-03433f2e9d1e10e7c1080289494]
aws_route.public_subnets_igw[3]: Refreshing state... [id=r-rtb-03433f2e9d1e10e7c1080289494]
aws_launch_configuration.alc: Refreshing state... [id=remix-recipe-prod-lc]
aws_elb.elb: Refreshing state... [id=remix-recipe-server-elb]
aws_route_table_association.public_subnets_association[4]: Refreshing state... [id=rtbassoc-0a29256b27cc8d765]
aws_route_table_association.public_subnets_association[3]: Refreshing state... [id=rtbassoc-0e0f58fc63e546404]
aws_route_table_association.public_subnets_association[2]: Refreshing state... [id=rtbassoc-0e0468fb16730045c]
aws_route_table_association.public_subnets_association[5]: Refreshing state... [id=rtbassoc-0802b8fa82971a529]
aws_route_table_association.public_subnets_association[0]: Refreshing state... [id=rtbassoc-008c4bd80a2938c9f]
aws_route_table_association.public_subnets_association[1]: Refreshing state... [id=rtbassoc-0fac2590760fc4c4b]
aws_autoscaling_group.asg: Refreshing state... [id=remix-recipe-prod-asg]
aws_autoscaling_attachment.asg_elb: Refreshing state... [id=remix-recipe-prod-asg-20230207151136152700000001]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_autoscaling_group.asg has been deleted
  - resource "aws_autoscaling_group" "asg" {
        id                        = "remix-recipe-prod-asg"
      - name                      = "remix-recipe-prod-asg" -> null
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_elb.elb has been deleted
  - resource "aws_elb" "elb" {
        id                          = "remix-recipe-server-elb"
      - name                        = "remix-recipe-server-elb" -> null
        tags                        = {
            "Environment" = "Production"
            "Name"        = "remix-recipe-server-elb"
            "Owner"       = "Shubham"
        }
        # (16 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_iam_role.role-launch-ec2 has been deleted
  - resource "aws_iam_role" "role-launch-ec2" {
        id                    = "role-launch-ec2"
      - name                  = "role-launch-ec2" -> null
        tags                  = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_internet_gateway.igw has been deleted
  - resource "aws_internet_gateway" "igw" {
      - id       = "igw-0ac123e9b2f9f6dc9" -> null
        tags     = {
            "Environment" = "Production"
            "Name"        = "main-internet-gateway"
            "Owner"       = "Shubham"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_launch_configuration.alc has been deleted
  - resource "aws_launch_configuration" "alc" {
        id                          = "remix-recipe-prod-lc"
      - name                        = "remix-recipe-prod-lc" -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_security_group.sg has been deleted
  - resource "aws_security_group" "sg" {
      - id                     = "sg-0ecf005d25660f34a" -> null
        name                   = "remix-recipe-nginx-security-group"
        tags                   = {}
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.public-subnet[0] has been deleted
  - resource "aws_subnet" "public-subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:619568494776:subnet/subnet-0a038ffe273e528cf" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1a" -> null
      - availability_zone_id                           = "use1-az1" -> null
      - cidr_block                                     = "10.0.1.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0a038ffe273e528cf" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "619568494776" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "Production"
          - "Name"        = "public-subnet-az-1"
          - "Owner"       = "Shubham"
        } -> null
      - tags_all                                       = {
          - "Environment" = "Production"
          - "Name"        = "public-subnet-az-1"
          - "Owner"       = "Shubham"
        } -> null
      - vpc_id                                         = "vpc-0019a2de5322a3397" -> null
    }

  # aws_subnet.public-subnet[1] has been deleted
  - resource "aws_subnet" "public-subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:619568494776:subnet/subnet-084b421443cfcb750" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1b" -> null
      - availability_zone_id                           = "use1-az2" -> null
      - cidr_block                                     = "10.0.2.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-084b421443cfcb750" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "619568494776" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "Production"
          - "Name"        = "public-subnet-az-2"
          - "Owner"       = "Shubham"
        } -> null
      - tags_all                                       = {
          - "Environment" = "Production"
          - "Name"        = "public-subnet-az-2"
          - "Owner"       = "Shubham"
        } -> null
      - vpc_id                                         = "vpc-0019a2de5322a3397" -> null
    }

  # aws_subnet.public-subnet[2] has been deleted
  - resource "aws_subnet" "public-subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:619568494776:subnet/subnet-02d15ccd3b52e5319" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1c" -> null
      - availability_zone_id                           = "use1-az4" -> null
      - cidr_block                                     = "10.0.3.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-02d15ccd3b52e5319" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "619568494776" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "Production"
          - "Name"        = "public-subnet-az-3"
          - "Owner"       = "Shubham"
        } -> null
      - tags_all                                       = {
          - "Environment" = "Production"
          - "Name"        = "public-subnet-az-3"
          - "Owner"       = "Shubham"
        } -> null
      - vpc_id                                         = "vpc-0019a2de5322a3397" -> null
    }

  # aws_subnet.public-subnet[3] has been deleted
  - resource "aws_subnet" "public-subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:619568494776:subnet/subnet-0086c7e08f9686a98" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1d" -> null
      - availability_zone_id                           = "use1-az6" -> null
      - cidr_block                                     = "10.0.4.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0086c7e08f9686a98" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "619568494776" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "Production"
          - "Name"        = "public-subnet-az-4"
          - "Owner"       = "Shubham"
        } -> null
      - tags_all                                       = {
          - "Environment" = "Production"
          - "Name"        = "public-subnet-az-4"
          - "Owner"       = "Shubham"
        } -> null
      - vpc_id                                         = "vpc-0019a2de5322a3397" -> null
    }

  # aws_subnet.public-subnet[4] has been deleted
  - resource "aws_subnet" "public-subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:619568494776:subnet/subnet-08e6078c1c8efdfdd" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1e" -> null
      - availability_zone_id                           = "use1-az3" -> null
      - cidr_block                                     = "10.0.5.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-08e6078c1c8efdfdd" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "619568494776" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "Production"
          - "Name"        = "public-subnet-az-5"
          - "Owner"       = "Shubham"
        } -> null
      - tags_all                                       = {
          - "Environment" = "Production"
          - "Name"        = "public-subnet-az-5"
          - "Owner"       = "Shubham"
        } -> null
      - vpc_id                                         = "vpc-0019a2de5322a3397" -> null
    }

  # aws_subnet.public-subnet[5] has been deleted
  - resource "aws_subnet" "public-subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:619568494776:subnet/subnet-0b6f663793f911886" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1f" -> null
      - availability_zone_id                           = "use1-az5" -> null
      - cidr_block                                     = "10.0.6.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0b6f663793f911886" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "619568494776" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "Production"
          - "Name"        = "public-subnet-az-6"
          - "Owner"       = "Shubham"
        } -> null
      - tags_all                                       = {
          - "Environment" = "Production"
          - "Name"        = "public-subnet-az-6"
          - "Owner"       = "Shubham"
        } -> null
      - vpc_id                                         = "vpc-0019a2de5322a3397" -> null
    }

  # aws_vpc.main has been deleted
  - resource "aws_vpc" "main" {
      - cidr_block                       = "10.0.0.0/16" -> null
      - default_route_table_id           = "rtb-03433f2e9d1e10e7c" -> null
      - id                               = "vpc-0019a2de5322a3397" -> null
        tags                             = {
            "Environment" = "Production"
            "Name"        = "main-vpc"
            "Owner"       = "Shubham"
        }
        # (14 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_subnet_ids.public_subnets will be read during apply
  # (config refers to values not yet known)
 <= data "aws_subnet_ids" "public_subnets" {
      + id     = (known after apply)
      + ids    = (known after apply)
      + tags   = (known after apply)
      + vpc_id = (known after apply)

      + filter {
          + name   = "tag:Name"
          + values = [
              + "public*",
            ]
        }
    }

  # aws_autoscaling_attachment.asg_elb will be created
  + resource "aws_autoscaling_attachment" "asg_elb" {
      + autoscaling_group_name = "prod-remix-recipe-auto-scaling-group"
      + elb                    = "prod-remix-recipe-load-balancer"
      + id                     = (known after apply)
    }

  # aws_autoscaling_group.asg will be created
  + resource "aws_autoscaling_group" "asg" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 2
      + force_delete              = true
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + launch_configuration      = "prod-remix-recipe-launch-configuration"
      + max_size                  = 10
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = "prod-remix-recipe-auto-scaling-group"
      + name_prefix               = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "prod-remix-recipe-webserver"
        }
    }

  # aws_elb.elb will be created
  + resource "aws_elb" "elb" {
      + arn                         = (known after apply)
      + availability_zones          = (known after apply)
      + connection_draining         = false
      + connection_draining_timeout = 300
      + cross_zone_load_balancing   = true
      + desync_mitigation_mode      = "defensive"
      + dns_name                    = (known after apply)
      + id                          = (known after apply)
      + idle_timeout                = 60
      + instances                   = (known after apply)
      + internal                    = false
      + name                        = "prod-remix-recipe-load-balancer"
      + security_groups             = (known after apply)
      + source_security_group       = (known after apply)
      + source_security_group_id    = (known after apply)
      + subnets                     = (known after apply)
      + tags                        = {
          + "Environment" = "Production"
          + "Name"        = "prod-remix-recipe-load-balancer"
          + "Owner"       = "Shubham"
        }
      + tags_all                    = {
          + "Environment" = "Production"
          + "Name"        = "prod-remix-recipe-load-balancer"
          + "Owner"       = "Shubham"
        }
      + zone_id                     = (known after apply)

      + health_check {
          + healthy_threshold   = 2
          + interval            = 30
          + target              = "HTTP:80/"
          + timeout             = 3
          + unhealthy_threshold = 5
        }

      + listener {
          + instance_port     = 3000
          + instance_protocol = "http"
          + lb_port           = 80
          + lb_protocol       = "http"
        }
    }

  # aws_iam_instance_profile.ec2-instance-profile must be replaced
-/+ resource "aws_iam_instance_profile" "ec2-instance-profile" {
      ~ arn         = "arn:aws:iam::619568494776:instance-profile/ec2_instance_profile" -> (known after apply)
      ~ create_date = "2023-02-06T20:57:01Z" -> (known after apply)
      ~ id          = "ec2_instance_profile" -> (known after apply)
      ~ name        = "ec2_instance_profile" -> "prod-iam-instance-profile" # forces replacement
      ~ role        = "role-launch-ec2" -> "prod-role-launch-instance"
      ~ tags        = {
          + "Environment" = "Production"
          + "Name"        = "prod-iam-instance-profile"
          + "Owner"       = "Shubham"
        }
      ~ tags_all    = {
          + "Environment" = "Production"
          + "Name"        = "prod-iam-instance-profile"
          + "Owner"       = "Shubham"
        }
      ~ unique_id   = "AIPAZAQJI7C4C4GSKFFEC" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role.role-launch-ec2 will be created
  + resource "aws_iam_role" "role-launch-ec2" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "prod-role-launch-instance"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "Production"
          + "Name"        = "prod-role-launch-instance"
          + "Owner"       = "Shubham"
        }
      + tags_all              = {
          + "Environment" = "Production"
          + "Name"        = "prod-role-launch-instance"
          + "Owner"       = "Shubham"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "Production"
          + "Name"        = "prod-main-internet-gateway"
          + "Owner"       = "Shubham"
        }
      + tags_all = {
          + "Environment" = "Production"
          + "Name"        = "prod-main-internet-gateway"
          + "Owner"       = "Shubham"
        }
      + vpc_id   = (known after apply)
    }

  # aws_launch_configuration.alc will be created
  + resource "aws_launch_configuration" "alc" {
      + arn                         = (known after apply)
      + associate_public_ip_address = true
      + ebs_optimized               = (known after apply)
      + enable_monitoring           = true
      + iam_instance_profile        = "prod-iam-instance-profile"
      + id                          = (known after apply)
      + image_id                    = "ami-0323c3dd2da7fb37d"
      + instance_type               = "t2.micro"
      + key_name                    = (known after apply)
      + name                        = "prod-remix-recipe-launch-configuration"
      + name_prefix                 = (known after apply)
      + security_groups             = (known after apply)
      + user_data                   = "a14df99f4c8cf82aeab865afc4fca11d070c3f62"

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = 8
          + volume_type           = "gp2"
        }
    }

  # aws_route.public_subnets_igw[0] will be created
  + resource "aws_route" "public_subnets_igw" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.public_subnets_igw[1] will be created
  + resource "aws_route" "public_subnets_igw" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.public_subnets_igw[2] will be created
  + resource "aws_route" "public_subnets_igw" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.public_subnets_igw[3] will be created
  + resource "aws_route" "public_subnets_igw" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.public_subnets_igw[4] will be created
  + resource "aws_route" "public_subnets_igw" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.public_subnets_igw[5] will be created
  + resource "aws_route" "public_subnets_igw" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table_association.public_subnets_association[0] will be created
  + resource "aws_route_table_association" "public_subnets_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_subnets_association[1] will be created
  + resource "aws_route_table_association" "public_subnets_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_subnets_association[2] will be created
  + resource "aws_route_table_association" "public_subnets_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_subnets_association[3] will be created
  + resource "aws_route_table_association" "public_subnets_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_subnets_association[4] will be created
  + resource "aws_route_table_association" "public_subnets_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_subnets_association[5] will be created
  + resource "aws_route_table_association" "public_subnets_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.sg will be created
  + resource "aws_security_group" "sg" {
      + arn                    = (known after apply)
      + description            = "Allow HTTP and HTTPS traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 3000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3000
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "prod-remix-recipe-security-group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "Production"
          + "Name"        = "prod-remix-recipe-security-group"
          + "Owner"       = "Shubham"
        }
      + tags_all               = {
          + "Environment" = "Production"
          + "Name"        = "prod-remix-recipe-security-group"
          + "Owner"       = "Shubham"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_ssm_parameter.foo will be destroyed
  # (because aws_ssm_parameter.foo is not in configuration)
  - resource "aws_ssm_parameter" "foo" {
      - arn       = "arn:aws:ssm:us-east-1:619568494776:parameter/foo" -> null
      - data_type = "text" -> null
      - id        = "foo" -> null
      - name      = "foo" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
      - tier      = "Standard" -> null
      - type      = "String" -> null
      - value     = (sensitive value)
      - version   = 1 -> null
    }

  # aws_subnet.private-subnet[0] will be created
  + resource "aws_subnet" "private-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "prod-private-subnet-az-1"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "prod-private-subnet-az-1"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private-subnet[1] will be created
  + resource "aws_subnet" "private-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "prod-private-subnet-az-2"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "prod-private-subnet-az-2"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private-subnet[2] will be created
  + resource "aws_subnet" "private-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "prod-private-subnet-az-3"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "prod-private-subnet-az-3"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private-subnet[3] will be created
  + resource "aws_subnet" "private-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "prod-private-subnet-az-4"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "prod-private-subnet-az-4"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private-subnet[4] will be created
  + resource "aws_subnet" "private-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1e"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "prod-private-subnet-az-5"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "prod-private-subnet-az-5"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private-subnet[5] will be created
  + resource "aws_subnet" "private-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1f"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "prod-private-subnet-az-6"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "prod-private-subnet-az-6"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public-subnet[0] will be created
  + resource "aws_subnet" "public-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "prod-public-subnet-az-1"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "prod-public-subnet-az-1"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public-subnet[1] will be created
  + resource "aws_subnet" "public-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "prod-public-subnet-az-2"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "prod-public-subnet-az-2"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public-subnet[2] will be created
  + resource "aws_subnet" "public-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "prod-public-subnet-az-3"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "prod-public-subnet-az-3"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public-subnet[3] will be created
  + resource "aws_subnet" "public-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "prod-public-subnet-az-4"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "prod-public-subnet-az-4"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public-subnet[4] will be created
  + resource "aws_subnet" "public-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1e"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "prod-public-subnet-az-5"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "prod-public-subnet-az-5"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public-subnet[5] will be created
  + resource "aws_subnet" "public-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1f"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "prod-public-subnet-az-6"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "prod-public-subnet-az-6"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Environment" = "Production"
          + "Name"        = "prod-main-vpc"
          + "Owner"       = "Shubham"
        }
      + tags_all                             = {
          + "Environment" = "Production"
          + "Name"        = "prod-main-vpc"
          + "Owner"       = "Shubham"
        }
    }

Plan: 33 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @shubhamcommits, Action: `pull_request`*